{
    "data": "<strong><i>Risk warning, please be sure to read:</i></strong>\nPlease note that using this bot requires you to provide your wallet private key. We strongly recommend that you use an account other than your friend.tech main account. Of course, it is possible to generate a wallet automatically by clicking on \"Generate wallet\" button, but we do not recommend it and will explain the problems later. You should be aware that direct manipulation of private keys is risky, regardless of the bot you use at any given time and place. We don't claim to be the most secure product in the world, but we do our best to minimize the risks to keep our users safe. We also want you to be more security conscious and learn more about Web3 and blockchain security to prevent your wallet from being hacked.\nSome security-related urls that may be useful:\n<a href=\"https://github.com/slowmist/Blockchain-dark-forest-selfguard-handbook\">https://github.com/slowmist/Blockchain-dark-forest-selfguard-handbook</a>\n<a href=\"https://twitter.com/evilcos\">https://twitter.com/evilcos</a>\n<a href=\"https://twitter.com/SlowMist_Team\">https://twitter.com/SlowMist_Team</a>\n<a href=\"https://twitter.com/peckshield\">https://twitter.com/peckshield</a>\n<a href=\"https://twitter.com/PeckShieldAlert\">https://twitter.com/PeckShieldAlert</a>\n\n<strong><i>About following to buy and threshold:</i></strong>\nThe core function of this bot is following to buy. Users can enter addresses that need to be monitored in batches. When a key is purchased from the address monitored by the user, your account will be automatically purchased. Please note, be sure that the account you are following is not a phishing account. If the account you follow makes malicious purchases, you could suffer serious financial losses. Therefore, it is necessary to set a price threshold. If you set a threshold and the total price of the keys exceeds the threshold when you follow the order or purchase directly, the purchase will not be successful.\n\n<strong><i>About Anti-sniper:</i></strong>\nAnti-sniper is another special feature of the bot. As we all know, there are a lot of snipers who constantly scan all the data and buy a lot of keys immediately after a new user registers an account. At this time, a lot of users may not have purchased their keys in bulk before the snipers, and then after a period of time the snipers will sell all these keys and make a profit from them. Anti-sniper feature allows users to buy their own keys in bulk immediately after registering an account without being preempted by others. This feature only works on first created wallets that have never had any keys purchased. <strong>Don't buy your keys on the front end after generating a wallet from friend.tech!</strong> Go to the https://www.friend.tech/account page now to export your private key immediately, then use the anti-sniping feature to purchase it directly. Note: This feature requires 0.004 ETH per transaction as a handling fee.\n\n<strong><i>I can't export my account without buying a key after registering at friend.tech:</i></strong>\nOnce you have registered, please go directly to the https://www.friend.tech/account page to export your account.\n\n<strong><i>About Referral:</i></strong>\nThe top 10 referrals receive regular ETH bonus. Please invite real users, fake users will not be counted!\n\n<strong><i>Some others:</i></strong>\nPlease open an account with friend.tech and then export your wallet. Because bot-generated wallets are not actually registered on friend.tech, they are not tied to a cell phone number or Twitter account, and they can only buy and sell keys on the chain. please try not to use bot-generated wallets unless you just want to buy, sell and follow orders.\n\n<strong><i>Future plans:</i></strong>\nPlease rest assured that we will always update and maintain this bot. We are developing our official website to be able to provide more services. We are also developing pending and taker orders. We are also planning to cooperate with friend.tech officials to help test friend.tech applications and provide suggestions for improvements. Our ultimate goal is to build a large exchange and community portal about friend.tech.\n\n<strong><i>Some websites that may be useful:</i></strong>\n<a href='https://friendmex.com'>https://friendmex.com</a>\n<a href='https://friendswap.io/'>https://friendswap.io</a>\n<a href='https://risedle.com/friendtech'>https://risedle.com/friendtech</a>\n<a href='https://basescan.org/address/0xcf205808ed36593aa40a44f10c7f7c2f67d4a4d4'>Friend.tech contract address</a>"
}
